app/controllers/example_inputs_controller.rb

  def index
    @example_inputs = ExampleInput.all
---
SELECT "example_inputs".* FROM "example_inputs"