app/controllers/example_inputs_controller.rb

    def set_example_input
      @example_input = ExampleInput.find(params[:id])
---
SELECT  "example_inputs".* FROM "example_inputs" WHERE "example_inputs"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]