app/controllers/revenues_controller.rb

    def set_revenue
      @revenue = Revenue.find(params[:id])
---
SELECT  "revenues".* FROM "revenues" WHERE "revenues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]