app/controllers/revenues_controller.rb

  def index
    @revenues = Revenue.all.order('created_at DESC')
---
SELECT "revenues".* FROM "revenues" ORDER BY created_at DESC